<template>
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width="20"
    height="20"
    viewBox="0 0 24 24"
    fill="currentColor"
  >
    <path
      d="M21 15.46l-5.27-.61c-.5-.06-1.01.14-1.34.5l-2.2 2.2c-3.3-1.7-6.04-4.44-7.74-7.74l2.2-2.2c.36-.36.56-.86.5-1.36L8.54 3c-.12-.76-.82-1.31-1.59-1.31H3.98C3.22 1.69 2.53 2.24 2.4 3c-.59 3.64.55 7.42 3.08 10.61s6.97 3.68 10.61 3.08c.76-.13 1.31-.82 1.31-1.59v-2.97c0-.77-.55-1.47-1.31-1.59z"
    />
  </svg>
</template>

<script>
</script>

<style scoped>
svg {
  fill: #000; /* Màu của icon */
}
</style>
